WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/hcom_nx/commands/hcom_nx_ex_flash.c
/****************************************************************************
 * \configs\stm32f777zit6-meadow\src\hcom_nx\commands\hcom_nx_ex_flash.c
 * 
 *   Copyright (C) 2019 - 2024 Wilderness Labs. All rights reserved.
 *   Author:  Wilderness Labs
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************/

// This module contains code that access the external (i.e. not part of
// the STM32F7) flash memory

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include "../hcom_nx_common.h"
#include <meadow/hcom_protocol.h>
#include <meadow/hcom_upd_shared.h>
#include <meadow/hcom_shared_common.h>
#include <meadow/hcom_bbreg_defn.h>
#include <meadow/meadow_hw_version.h>

#include <nuttx/arch.h>
#include <nuttx/mtd/mtd.h>
#include "stm32_uid.h"          // stm32_get_uniqueid()

#include <arch/board/boardctl.h>
#include <sys/boardctl.h>

#include <sys/stat.h>

/****************************************************************************
 * Uncomment the #define below to turn on debug help macros.
 ****************************************************************************/
// #define USE_MEADOW_DEBUG_HELPERS
#include <meadow/meadow_debug_helpers.h>

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define error(x, ...)                                                                          \
  do                                                                                           \
  {                                                                                            \
    if (cmdData)                                                                               \
    {                                                                                          \
      cmdData->logLen = snprintf(cmdData->logMsg, HCOM_NX_CMD_LOG_MSG_SIZE, x, ##__VA_ARGS__); \
    }                                                                                          \
    else                                                                                       \
    {                                                                                          \
      char buf1[256];                                                                          \
      snprintf(buf1, sizeof(buf1), x, ##__VA_ARGS__);                                          \
      syslog(LOG_ERR, buf1);                                                                   \
    }                                                                                          \
  } while (0);

#if defined(USE_MEADOW_DEBUG_HELPERS)
//
//  Output information messages when debugging.
//
#define info(x, ...)                                                  \
  do                                                                  \
  {                                                                   \
    if (cmdData)                                                      \
    {                                                                 \
      char buf2[256];                                                 \
      snprintf(buf2, sizeof(buf2), "%s@d-%s\n", thisFile, __LINE__, x); \
      snprintf(buf2, sizeof(buf2), buf2, ##__VA_ARGS__);              \
      cmdData->send_host_msg(HCOM_HOST_REQUEST_TEXT_INFORMATION, 0,   \
                             buf2, thisFile, __LINE__);               \
    }                                                                 \
    else                                                              \
    {                                                                 \
      char buf3[256];                                                 \
      snprintf(buf3, sizeof(buf3), x, ##__VA_ARGS__);                 \
      syslog(LOG_ERR, buf3);                                          \
    }                                                                 \
  } while (0);
#else
//
//  No output when not debugging.
//
#define info(x, ...)
#endif

/****************************************************************************
 * Private Data
 ****************************************************************************/

/**
 * @brief Name of this file.
 */
static char *thisFile = __FILE__;

/**
 * @brief Pointer to the _mtd driver for the flash memory on the board.
 */
static FAR struct mtd_dev_s *_mtd;

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: hcom_nx_exec_ex_flash_setup
 *
 * Description:
 *  Copy the pointer to the flash driver into a static local variable.
 *
 * Input Parameters:
 *  mtd - Pointer to the flash driver.
 *
 * Returned Value:
 *  OK
 *
 * Assumptions/Limitations:
 *  None.
 *
 ****************************************************************************/
int hcom_nx_exec_ex_flash_setup(FAR struct mtd_dev_s *mtd)
{
  _mtd = mtd;
  return OK;
}

/****************************************************************************
 * Name: hcom_nx_exec_ex_flash_erase_ex_flash
 *
 * Description:
 *  Process the CLI request to erase all of the flash memory.
 *
 * Input Parameters:
 *  cmdData - Pointer to the command data structure holding the parameters
 *            (arguments) from CLI.
 *
 * Returned Value:
 *  OK on success, negative error code on error.
 *
 * Assumptions/Limitations:
 *  _mtd is set for the current flash driver.
 *
 ****************************************************************************/
int hcom_nx_exec_ex_flash_erase_ex_flash(struct hcom_nx_cmd_data *cmdData)
{
  int ret;

